text = `
形势与政策2023春期末考试题库

一、单选题（292）
1、中国共产党第二十次全国代表大会于2022年（  ）在北京开幕。
A、10月14日
B、10月15日
C、10月16日
D、10月17日
答案：C
2、中国共产党第二十次全国代表大会，是在全党全国各族人民迈上全面建设社会主义现代化国家新征程、向第（  ）个百年奋斗目标进军的关键时刻召开的一次十分重要的大会。
A、一
B、二
C、三
D、四
答案：B
3、中国共产党已走过（  ）年奋斗历程。
A、百
B、九十
C、八十
D、七十
答案：A
4、全党同志务必不忘初心、（  ），务必谦虚谨慎、艰苦奋斗，务必敢于斗争、善于斗争，坚定历史自信，增强历史主动，谱写新时代中国特色社会主义更加绚丽的华章。
A、继续前行
B、牢记使命
C、方得始终
D、砥砺前行
答案：B
5、面对突如其来的新冠肺炎疫情，我们坚持（  ），坚持动态清零不动摇，开展抗击疫情人民战争、总体战、阻击战，最大限度保护了人民生命安全和身体健康，统筹疫情防控和经济社会发展取得重大积极成果。
A、人民至上、生命至上
B、人民为重、生命为重
C、人民为本、生命至本
D、人民至上、生命为本
答案：A
6、我们全面加强党的领导，确保党中央权威和集中统一领导，确保党发挥（  ）的领导核心作用。
A、统领全局、引导各方
B、总领全局、协调各方
C、总揽全局、协调各方
D、统揽全局、领导各方
答案：C
7、我们经过接续奋斗，实现了（  ）这个中华民族的千年梦想。
A、中国梦
B、小康
C、强国
D、强军
答案：B
8、中国特色社会主义事业“五位一体”总体布局是指全面推进经济建设、政治建设、文化建设、社会建设、（  ）
A、制度建设
B、生态文明建设
C、作风建设
D、法治建设
答案：B
9、、我国实行更加积极主动的开放战略，共建“一带一路”成为（  ）多个国家和地区的主要贸易伙伴，货物贸易总额居世界第一，吸引外资和对外投资居世界前列，形成更大范围、更宽领域、更深层次对外开放格局。
A、一百四十
B、一百三十
C、一百二十
D、一百一十
答案：A
10、我们坚持走中国特色社会主义政治发展道路，全面发展全过程人民民主，社会主义民主政治制度化、（  ）、程序化全面推进，人民当家作主更为扎实，全面依法治国总体格局基本形成。
A、民主化
B、科学化
C、规范化
D、法制化
答案：C
11、党和国家以巨大的政治勇气全面深化（  ），许多领域实现历史性变革、系统性重塑、整体性重构，中国特色社会主义制度更加成熟更加定型，国家治理体系和治理能力现代化水平明显提高。
A、发展
B、改革
C、建设
D、从严治党
答案：B
12、党和国家确立和坚持马克思主义在意识形态领域指导地位的根本制度，社会主义核心价值观广泛传播，中华优秀传统文化得到创造性转化、创新性发展，文化事业日益繁荣，网络生态持续向好，意识形态领域形势发生（  ）转变。
A、全局性、彻底性
B、全局性、根本性
C、全面性、彻底性
D、全面性、根本性
答案：B
13、坚持绿水青山就是金山银山的理念，坚持山水林田湖草沙（  ）保护和系统治理，生态文明制度体系更加健全。
A、全局化
B、系统化
C、可持续化
D、一体化
答案：D
14、贯彻总体国家安全观，以坚定的意志品质维护国家主权、安全、（  ），国家安全得到全面加强。
A、经济利益
B、海上利益
C、海外利益
D、发展利益
答案：D
15、我国推动构建新型国际关系，积极参与全球治理体系改革和建设，全面开展抗击新冠肺炎疫情（  ），赢得广泛国际赞誉，我国国际影响力、感召力、塑造力显著提升。
A、国际合作
B、协助合作
C、区域合作
D、国家交流
答案：A
16、深入推进全面（  ），坚持打铁必须自身硬，提出和落实新时代党的建设总要求。
A、依法治党
B、依法治国
C、从严治党
D、从严治国
答案：C
17、（  ）是我们立党立国、兴党兴国的根本指导思想。
A、马克思主义
B、毛泽东思想
C、邓小平理论
D、“三个代表”重要思想
答案：A
18、新时代的伟大成就是党和人民一道拼出来、干出来、（  ）出来的！
A、努力
B、创造
C、奋斗
D、开拓
答案：C
19、走过百年奋斗历程的中国共产党在革命性锻造中更加坚强有力，在坚持和发展中国特色社会主义的历史进程中始终成为坚强（  ）。
A、引导者
B、领导者
C、领导力量
D、领导核心
答案：D
20、中国人民的前进动力更加强大、（  ）更加昂扬、必胜信念更加坚定，中国共产党和中国人民正信心百倍推进中华民族从站起来、富起来到强起来的伟大飞跃。
A、奋斗精神
B、创造精神
C、开拓精神
D、改革精神
答案：A
21、改革开放和社会主义现代化建设深入推进，实现中华民族伟大复兴进入了（  ）的历史进程。
A、不可改变
B、不可逆转
C、不可阻挡
D、不可阻碍
答案：B
22、科学社会主义在二十一世纪的中国焕发出新的蓬勃生机，（  ），中国共产党和中国人民为解决人类面临的共同问题提供更多更好的中国智慧、中国方案、中国力量，为人类和平与发展崇高事业作出新的更大的贡献！
A、中国式发展化为人类社会发展指引了新的发展方向
B、中国式改革为全球经济发展提供了新的经验
C、中国式现代化为人类实现现代化提供了新的选择
D、中国式脱贫攻坚战为全球减贫事业做出巨大贡献
答案：C
23、我们提出新时代解决台湾问题的总体方略，促进两岸交流合作，坚决反对“台独”分裂行径，坚决反对（  ）干涉，牢牢把握两岸关系主导权和主动权。
A、西方势力
B、外部势力
C、境内外分裂势力
D、台独势力
答案：B
24、我们全面准确推进（  ）实践，坚持（  ）、“港人治港”、“澳人治澳”、高度自治的方针，推动香港进入由乱到治走向由治及兴的新阶段，香港、澳门保持长期稳定发展良好态势。
A、“一国两制”“一国两制”
B、“一国两制”“区域自治”
C、“一国两制”“特区自治”
D、“一国两制”“高度自治”
答案：A
25、习近平总书记强调，全面建设社会主义现代化国家，实现新时代新征程各项目标任务，关键在（  ）。
A、党
B、政府
C、人民
D、干部
答案：A
26、当前反腐败斗争取得（  ）胜利并全面巩固，消除了党、国家、军队内部存在的严重隐患。
A、全面性
B、全区性
C、压倒性
D、开拓性
答案：C
27、（  ）指导是我们党坚定信仰信念、把握历史主动的根本所在。
A、马克思主义科学理论
B、社会主义
C、《共产党宣言》
D、新民主主义
答案：A
28、中国共产党人深刻认识到，只有把马克思主义基本原理同（   ）相结合、同中华优秀传统文化相结合，坚持运用辩证唯物主义和历史唯物主义，才能正确回答时代和实践提出的重大问题，才能始终保持马克思主义的蓬勃生机和旺盛活力。
A、中国具体实践
B、中国具体实际
C、中国具体国情
D、中国具体实情
答案：B
29、实践没有止境，理论创新也没有止境。不断谱写马克思主义中国化时代化新篇章，是当代中国共产党人的庄严（  ）。
A、历史责任
B、历史任务
C、职责使命
D、职责担当
答案：A
30、新时代十年的伟大变革，在党史、新中国史、改革开放史、社会主义发展史、中华民族发展史上具有（  ）意义。
A、划时代
B、跨时代
C、重要现实
D、里程碑
答案：D
31、实践告诉我们，中国共产党为什么能，中国特色社会主义为什么好，归根到底是马克思主义行，是（  ）的马克思主义行。
A、中国化现代化
B、中国化时代化
C、中国化科学化
D、中国化民主化
答案：B
32、继续推进实践基础上的理论创新，首先要把握好（  ）的世界观和方法论，坚持好、运用好贯穿其中的立场观点方法。
A、新时代中国特色社会主义思想
B、马克思主义中国化
C、辩证唯物主义和历史唯物主义
D、实践是检验真理的唯一标准
答案：A
33、必须坚持人民至上，坚持自信自立，坚持守正创新，坚持问题导向，坚持（  ），坚持胸怀天下，站稳人民立场、把握人民愿望、尊重人民创造、集中人民智慧。
A、全局观念
B、核心观念
C、系统观念
D、大局观念
答案：C
34、从现在起，中国共产党的（  ）就是团结带领全国各族人民全面建成社会主义现代化强国、实现第二个百年奋斗目标。
A、重要任务
B、核心任务
C、第一任务
D、中心任务
答案：D
35、（  ），是中国共产党领导的社会主义现代化，既有各国现代化的共同特征，更有基于自己国情的中国特色。
A、中国式发展化
B、中国式现代化
C、中国式科学化
D、中国式创造化
答案：B
36、中国式现代化的本质要求是、坚持（   ），坚持中国特色社会主义。
A、从严管党治党
B、人民民主专政
C、人民当家做主
D、中国共产党领导
答案：D
37、未来五年是全面建设社会主义现代化国家开局起步的（  ）。
A、基础时期
B、发展时期
C、关键时期
D、攻坚时期
答案：C
38、高质量发展是全面建设社会主义现代化国家的首要（  ）。
A、使命
B、职责
C、任务
D、责任
答案：C

39、要增强全党全国各族人民的志气、骨气、底气，不信邪、不怕鬼、不怕压，知难而进、迎难而上，统筹发展和安全，全力战胜前进道路上各种困难和挑战，依靠顽强斗争打开事业发展（  ）。
A、新天地
B、新局面
C、新篇章
D、新领域
答案：A
40、没有坚实的（  ）基础，就不可能全面建成社会主义现代化强国。
A、政治文化
B、经济产业
C、物质技术
D、自然资源
答案：C
41、必须完整、准确、全面贯彻新发展理念，坚持社会主义市场经济改革方向，坚持高水平对外开放，加快构建以国内大循环为（  ）、国内国际双循环相互促进的新发展格局。
A、载体
B、主体
C、基础
D、首要
答案：B
44、要构建高水平社会主义市场经济体制，坚持和完善社会主义基本经济制度，毫不动摇巩固和发展（  ）经济，毫不动摇鼓励、支持、引导（  ）经济发展，充分发挥市场在资源配置中的决定性作用，更好发挥政府作用。
A、公有制 非公有制
B、公有制 民营
C、国有制 非公有制
D、国有制 民营
答案：A
43、建设现代化产业体系，坚持把发展经济的着力点放在（  ）上，推进（  ）。
A、数字经济 传统工业化
B、数字经济 新型工业化
C、实体经济 传统工业化
D、实体经济 新型工业化
答案：D
44、全面推进乡村振兴，（  ），确保中国人的饭碗牢牢端在自己手中。
①坚持农业农村优先发展，巩固拓展脱贫攻坚成果
②加快建设农业强国，扎实推动乡村产业、人才、文化、生态、组织振兴
③全方位夯实粮食安全根基，牢牢守住十八亿亩耕地红线
④加快发展“互联网＋农业”，提升农业发展科技水平
A、①③④
B、①②③
C、①②④
D、②③④
答案：B
45、推进高水平对外开放，稳步扩大规则、规制、管理、标准等制度型开放，加快建设贸易强国，推动共建（  ）高质量发展，维护多元稳定的国际经济格局和经贸关系。
A、亚太经合组织
B、上海合作组织
C、一带一路
D、20国集团
答案：C
46、（  ）是全面建设社会主义现代化国家的基础性、战略性支撑。
A、文化、经济、军事
B、经济、科技、人才
C、教育、经济、人才
D、教育、科技、人才
答案：D
47、必须坚持科技是（   ）、人才是（  ）、创新是（   ），深入实施科教兴国战略、人才强国战略、创新驱动发展战略，开辟发展新领域新赛道，不断塑造发展新动能新优势。
A、第一生产力 第一资源 第一动力
B、第一生产力 第一资源 第一创造力
C、第一驱动力 第一基础 第一创造力
D、第一驱动力 第一基础 第一创造力
答案：A
48、我们要办好人民满意的教育，全面贯彻党的教育方针，落实立德树人（  ），培养德智体美劳全面发展的社会主义建设者和接班人。
A、首要任务
B、第一要务
C、第一任务
D、根本任务
答案：D
49、完善科技创新体系，坚持创新在我国现代化建设全局中的（  ）。
A、第一地位
B、核心地位
C、重要地位
D、中心地位
答案：B
50、深入实施（   ）战略，坚持尊重劳动、尊重知识、尊重人才、尊重创造，完善人才战略布局，加快建设世界重要人才中心和创新高地，着力形成人才国际竞争的比较优势，把各方面优秀人才集聚到（  ）事业中来。
A、人才强国 经济社会发展
B、人才强国 党和人民
C、人才兴国 经济社会发展
D、人才兴国 党和人民
答案：B
51、我国是工人阶级领导的、以工农联盟为基础的人民民主专政的社会主义国家，国家一切权力属于（  ）。
A、工人
B、人民
C、农民
D、社会新阶层
答案：B
52、人民民主是社会主义的（  ），是全面建设社会主义现代化国家的应有之义。
A、根基
B、根本
C、生命
D、灵魂
答案：C
53、（  ）是社会主义民主政治的本质属性，是最广泛、最真实、最管用的民主。
A、直接人民民主
B、间接人民民主
C、全过程人民民主
D、人民民主专政
答案：C
54、必须坚定不移走中国特色社会主义政治发展道路，（  ），充分体现人民意志、保障人民权益、激发人民创造活力。
①坚持党的领导②人民当家做主③依法治国有机统一④坚持人民主体地位
A、①②③
B、①②④
C、①③④
D、①②③④
答案：D
55、要加强人民当家作主制度保障，坚持和完善我国根本政治制度、基本政治制度、重要政治制度，拓展民主渠道，丰富民主形式，支持和保证人民通过（  ）行使国家权力。
A、人民代表大会
B、投票
C、选举
D、网络监督
答案：A
56、中国共产党领导的多党合作和政治协商制度是我国一项基本（  ）。
A、国策
B、政策
C、政治制度
D、参政议政方式
答案：C
57、坚持我国宗教（  ）方向，积极引导宗教与社会主义社会相适应。
A、民主化
B、法制化
C、制度化
D、中国化
答案：D
58、全面（   ）是国家治理的一场深刻革命，关系党执政兴国，关系人民幸福安康，关系党和国家长治久安。
A、依法治国
B、依法治党
C、从严治党
D、依法治军
答案：A
59、必须更好发挥（  ）固根本、稳预期、利长远的保障作用，在（）上全面建设社会主义现代化国家。
A、道德 社会舆论
B、法律 法律层面
C、法治 法治轨道
D、制度 制度领域
答案：C
60、坚持依法治国、依法执政、依法行政共同推进，坚持法治国家、法治政府、法治社会一体建设，全面推进（  ），全面推进国家各方面工作法治化。
①科学立法②严格执法③公正司法④全民守法
A、①②③
B、①②④
C、②③④
D、①②③④
答案：D
61、我们要完善以（  ）为核心的中国特色社会主义法律体系，加强宪法实施和监督，加强重点领域、新兴领域、涉外领域立法。
A、道德
B、法律
C、社会舆论
D、宪法
答案：D
62、扎实推进依法行政，转变政府职能，优化政府职责体系和组织结构，提高（  ），全面推进严格规范公正文明执法。
A、行政效率和亲和力
B、行政效率和公信力
C、办事效率和亲和力
D、办事效率和公信力
答案：B
63、全面建设社会主义现代化国家，必须坚持中国特色社会主义（  ）发展道路。
A、科技
B、经济
C、文化
D、法治
答案：C
64、发展面向现代化、面向世界、面向未来的，民族的科学的大众的社会主义文化，激发全民族文化创新创造活力，增强实现中华民族伟大复兴的（  ）。
A、开拓力量
B、进取力量
C、奋斗力量
D、精神力量
答案：D
65、要坚持马克思主义在意识形态领域指导地位的（  ），坚持为人民服务、为社会主义服务。
A、基本制度
B、基本要求
C、根本制度
D、根本要求
答案：C
66、要建设具有强大凝聚力和引领力的社会主义意识形态，牢牢掌握（  ）对意识形态工作领导权，全面落实意识形态工作责任制。
A、党
B、国家
C、政府
D、公安机关
答案：A
67、广泛践行社会主义核心价值观，弘扬以伟大建党精神为源头的中国共产党人精神谱系，深入开展社会主义核心价值观宣传教育，深化（  ）教育，着力培养担当民族复兴大任的时代新人。
A、共产主义、集体主义、社会主义
B、共产主义、奉献主义、社会主义
C、爱国主义、集体主义、社会主义
D、爱国主义、奉献主义、社会主义
答案：C
68、繁荣发展文化事业和文化产业，坚持以（  ）为中心的创作导向。
A、人民
B、群众
C、农村
D、社会
答案：A
69、促进群众体育和竞技体育全面发展，加快建设（  ）。
A、体育大国
B、体育强国
C、竞技体育大国
D、竞技体育强国
答案：B
70、必须增强忧患意识，坚持（  ），做到居安思危、未雨绸缪，准备经受风高浪急甚至惊涛骇浪的重大考验。
A、底线思维
B、辩证思维
C、创新思维
D、法治思维
答案：A
71、增强中华文明传播力影响力，坚守（  ）立场，讲好中国故事、传播好中国声音，展现可信、可爱、可敬的中国形象，推动中华文化更好走向世界。
A、传统文化
B、中华文化
C、主流文化
D、社会主义文化
答案：B
72、要坚持以推动高质量发展为主题，把实施扩大内需战略同深化（  ）有机结合起来，增强国内大循环内生动力和可靠性，提升国际循环质量和水平。
A、转变发展方式
B、优化经济结构
C、供给侧结构性改革
D、转换增长动力
答案：C
73、加快建设现代化经济体系，着力提高全要素生产率，着力提升产业链供应链韧性和安全水平，（  ），推动经济实现质的有效提升和量的合理增长。
A、着力积极推动城乡区域协调发展
B、加快实施创新驱动发展战略
C、着力发展开放型经济
D、深化经济体制改革
答案：A
74、党的二十大报告强调，加快实施创新驱动发展战略，加快实现高水平科技自立自强，要以（  ）为导向，集聚力量进行原创性引领性科技攻关，坚决打赢关键核心技术攻坚战。
A、社会需求
B、人民需求
C、部队需求
D、国家战略需求
答案：D
75、发展基层民主，健全（  ）领导的基层群众自治机制，完善基层直接民主制度体系和工作体系。
A、党员
B、街道
C、政府
D、基层党组织
答案：D
76、巩固和发展最广泛的（  ），完善大统战工作格局，坚持大团结大联合，动员全体中华儿女围绕实现中华民族伟大复兴中国梦一起来想、一起来干。
A、民族统一战线
B、爱国统一战线
C、海内外中华儿女
D、国内外友好组织
答案：B
77、江山就是人民，人民就是江山。中国共产党领导人民打江山、守江山，守的是（  ）。
A、人民的美好生活
B、人民的幸福生活
C、人民对美好生活的向往
D、人民的心
答案：D
78、必须坚持在发展中（  ），鼓励共同奋斗创造美好生活，不断实现人民对美好生活的向往。
A、保障和提升民生水平
B、保障和改善民生
C、不断提升群众生活水平
D、增加群众生活的幸福感、获得感
答案：B
79、我国的分配制度是（  ）。
A、按劳分配为主体、按需分配为辅
B、按需分配为主体、按劳分配为辅
C、按劳分配为主体、多种分配方式并存
D、按需分配为主体、多种分配方式并存
答案：C
80、尊重自然、顺应自然、保护自然，是全面建设社会主义现代化国家的（  ）。
A、必然要求
B、内在要求
C、必然条件
D、内在条件
答案：B
81、必须牢固树立和践行绿水青山就是金山银山的理念，站在人与自然（  ）的高度谋划发展。
A、和谐共存
B、和谐共生
C、和谐共处
D、和谐共融
答案：B
82、（  ）是民族复兴的根基。
A、主权安全
B、经济发展
C、国家富强
D、国家安全
答案：D
83、国家安全要坚持以（  ）为宗旨、以（  ）为根本、以（  ）为基础。
A、群众安全 政治安全 发展安全
B、人民安全 政治安全 发展安全
C、群众安全 政治安全 经济安全
D、人民安全 政治安全 经济安全
答案：D
84、如期实现建军一百年奋斗目标，加快把人民军队建成世界一流军队，是全面建设社会主义现代化国家的（  ）。
A、总体要求
B、现实要求
C、战略要求
D、根本要求
答案：C
85、新时代贯彻党的强军思想，贯彻新时代军事战略方针，必须坚持党对人民军队的（  ）。
A、直接领导
B、间接领导
C、直接命令
D、绝对领导
答案：D
86、全面加强人民军队党的（  ），确保枪杆子永远听（）指挥。
A、领导 军委
B、领导 党
C、建设 军委
D、建设 党
答案：D
87、全面准确、坚定不移贯彻“一国两制”、“港人治港”、“澳人治澳”、高度自治的（  ）。
A、政策
B、方针
C、法律
D、法规
答案：B
88、中国始终坚持维护世界和平、促进共同发展的外交政策宗旨，致力于推动构建（  ）。
A、世界发展新秩序
B、世界贸易新秩序
C、人类命运共同体
D、全球发展命运共同体
答案：C
89、中国坚定奉行（  ）的和平外交政策。
A、互帮互助
B、不结盟
C、独立自主
D、互不干涉
答案：C
90、中国坚持在（  ）基础上同各国发展友好合作。
A、互利互惠原则
B、和谐共处原则
C、和谐发展原则
D、和平共处五项原则
答案：D
91、中国坚持对外开放的（  ），坚定奉行互利共赢的开放（  ），不断以中国新发展为世界提供新机遇，推动建设开放型世界经济，更好惠及各国人民。
A、基本方针 战略
B、基本国策 战略
C、基本政策 方略
D、基本制度 方略
答案：B
92、全面建设社会主义现代化国家、全面推进中华民族伟大复兴，关键在（  ）。
A、党
B、国家
C、军队
D、个人
答案：A
93、我们党作为世界上最大的（  ），要始终赢得人民拥护、巩固长期执政地位，必须时刻保持解决大党独有难题的清醒和坚定。
A、社会主义统治党
B、社会主义行政党
C、马克思主义执政党
D、马克思主义行政党
答案：C
94、全党必须牢记，全面（  ）永远在路上，党的（  ）永远在路上。
A、依法治党 自我革命
B、依法治党 自我革新
C、从严治党 自我革命
D、从严治党 自我革新
答案：C
95、我们要落实新时代党的建设（  ），健全全面从严治党体系，全面推进党的自我净化、自我完善、自我革新、自我提高，使我们党坚守初心使命，始终成为中国特色社会主义事业的坚强（  ）。
A、总需求 引导核心
B、总需求 领导核心
C、总要求 引导核心
D、总要求 领导核心
答案：D
96、要坚持和加强党中央集中统一领导，健全总揽全局、协调各方的党的（  ）体系，完善党中央重大决策部署落实机制，确保全党在政治立场、政治方向、政治原则、政治道路上同党中央保持高度一致，确保党的团结统一。
A、领导制度
B、建设制度
C、指挥制度
D、组织制度
答案：A
97、坚持不懈用（  ）凝心铸魂，全面加强党的思想建设，加强理想信念教育，引导全党牢记党的宗旨，自觉做共产主义远大理想和中国特色社会主义共同理想的坚定信仰者和忠实实践者。
A、马克思列宁主义
B、毛泽东思想
C、社会主义核心价值观
D、习近平新时代中国特色社会主义思想
答案：D
98、十年来，我们取得一系列标志性成果，经受住了来自（  ）等方面的风险挑战考验。
A、政治、经济、意识形态、生态环境
B、政治、经济、意识形态、自然界
C、政治、经济、文化、自然界
D、政治、经济、自然界
答案：B
99、经过不懈努力，党找到了自我革命这一跳出治乱兴衰历史周期率的第二个答案，确保党永远（  ）。
A、不变心、不变质、不变味
B、不变心、不变色、不变味
C、不变心、不变质、不变色
D、不变质、不变色、不变味
答案：D
100、治国有常，利民为本。（  ）是立党为公、执政为民的本质要求。
A、增进民生福祉
B、建设生态文明
C、实现共同富裕
D、促进社会公平
答案：A
101、我们要实现好、维护好、发展好最广大人民（  ），紧紧抓住人民最关心最直接最现实的利益问题。
A、现实利益
B、根本利益
C、现实难题
D、根本难题
答案：B
102、实施（  ）战略，强化（  ）政策，健全就业公共服务体系，加强困难群体就业兜底帮扶，消除影响平等就业的不合理限制和就业歧视，使人人都有通过勤奋劳动实现自身发展的机会。
A、就业优先 就业扶持
B、就业优先 就业培训
C、创业扶持 就业优先
D、就业优先 就业优先
答案：D
103、健全社会保障体系，健全（  ）、统筹城乡、公平统一、安全规范、可持续的多层次社会保障体系，扩大社会保险覆盖面。坚持男女平等（  ），保障妇女儿童合法权益。
A、覆盖全国 基本国策
B、覆盖全国 基本制度
C、覆盖全民 基本国策
D、覆盖全民 基本制度
答案：C
104、推进健康中国建设，把保障人民健康放在优先发展的（  ）位置，建立生育支持政策体系，实施积极应对人口老龄化（  ），促进中医药传承创新发展，健全公共卫生体系，加强重大疫情防控救治体系和应急能力建设，有效遏制重大传染性疾病传播。
A、战略 国家战略
B、战略 国家方针
C、核心 国家战略
D、核心 国家方针
答案：A
105、我们要推进美丽中国建设，坚持山水林田湖草沙一体化保护和系统治理，统筹（  ）、污染治理、生态保护、应对气候变化，协同推进降碳、减污、扩绿、增长，推进生态优先、节约集约、绿色低碳发展。
A、产业结构优化
B、产业结构调整
C、发展可再生能源
D、发展新能源经济
答案：B
106、必须坚定不移贯彻（  ），把维护国家安全贯穿党和国家工作各方面全过程，确保国家安全和社会稳定。
A、国家发展观
B、总体国家发展观
C、国家安全观
D、总体国家安全观
答案：D
107、“一国两制”是中国特色社会主义的伟大创举，是香港、澳门回归后保持长期繁荣稳定的最佳（  ），必须长期坚持。
A、制度安排
B、政策安排
C、方针安排
D、法律安排
答案：A
108、支持香港、澳门更好融入国家发展大局，为（  ）更好发挥作用。
A、促进区域协调发展
B、促进内地经济发展
C、实现小康社会
D、实现中华民族伟大复兴
答案：D
109、坚持和完善“（  ）”是新时代党解决台湾问题总体方略的根本保证。
A、和平发展
B、一国两制
C、民族区域自治
D、九二共识
答案：B
110、当前，世界之变、时代之变、历史之变正以前所未有的方式展开，人类社会面临前所未有的（  ）。
A、机会
B、机遇
C、挑战
D、难题
答案：C
111、必须持之以恒推进全面从严治党，深入推进新时代党的建设新的伟大工程，以党的（   ）引领社会革命。
A、自我改革
B、自我革命
C、自我反省
D、自我监督
答案：B
112、完善党的自我革命制度规范体系，坚持（  ），健全党统一领导、全面覆盖、权威高效的监督体系，发挥政治巡视利剑作用，落实全面从严治党政治责任，用好问责利器。
A、依法治党、依规治党
B、依法管党、依规管党
C、制度治党、依规治党
D、制度管党、依规管党
答案：C
113、增强党组织（  ），坚持大抓基层的鲜明导向，把基层党组织建设成为有效实现党的领导的坚强战斗堡垒，激励党员发挥先锋模范作用，保持党员队伍先进性和纯洁性。
A、政治功能和制度功能
B、政治功能和组织功能
C、政治属性和制度功能
D、政治属性和组织功能
答案：B
114、坚决打赢反腐败斗争攻坚战持久战，腐败是危害党的生命力和战斗力的最大毒瘤，反腐败是（  ）的自我革命。
A、最直接
B、最根本
C、最有效
D、最彻底
答案：D
115、全党要坚持全心全意为人民服务的（  ），树牢群众观点，贯彻群众路线。
A、根本使命
B、根本宗旨
C、根本任务
D、根本职责
答案：B
116、全党要把青年工作作为战略性工作来抓，用党的科学理论（  ）青年，用党的初心使命（  ）青年，做青年朋友的知心人、青年工作的热心人、青年群众的引路人。
A、教育 感化
B、教育 感召
C、武装 感化
D、武装 感召
答案：D
117、发展是党执政兴国的第一（  ）。
A、任务
B、要务
C、使命
D、责任
答案：B
118、我们要坚持走中国特色社会主义（  ），建设中国特色社会主义（ ）、建设社会主义（  ），围绕保障和促进社会公平正义。
A、法治道路 法律体系 法治社会
B、法治道路 法规体系 法律国家
C、法治道路 法治体系 法律国家
D、法治道路 法治体系 法治国家
答案：D
119、加快建设公正高效权威的社会主义司法制度，努力让人民群众在每一个司法案件中感受到（  ）。
A、公平公正
B、公平公开
C、平等正义
D、公平正义
答案：D
120、党的思想路线是（  ）。
①一切从实际出发  ②理论联系实际
③实事求是       ④在实践中检验真理和发展真理
A、①②③④
B、②③④
C、①③④
D、①②③
答案：A
121、以社会主义核心价值观为引领，发展社会主义先进文化，弘扬革命文化，传承中华优秀传统文化，满足人民日益增长的精神文化需求，巩固全党全国各族人民团结奋斗的共同思想基础，不断提升（  ）。
A、国家文化硬实力和中华文化影响力
B、国家文化硬实力和中华传统文化影响力
C、国家文化软实力和中华文化影响力
D、国家文化软实力和中华传统文化影响力
答案：C
122、加强和改进侨务工作，形成共同致力民族复兴的（  ）。
A、核心力量
B、重要力量
C、强大力量
D、关键力量
答案：C
123、加强全媒体传播体系建设，推动形成良好（  ）。
A、社会生态
B、舆论生态
C、文化生态
D、网络生态
答案：D
124、国家安全是民族复兴的根基，（  ）是国家强盛的前提。
A、社会安全
B、社会稳定
C、国家安全
D、国家稳定
答案：B
125、人民军队要健全贯彻（  ）负责制体制机制。
A、部队首长
B、国务院
C、党组织
D、军委主席
答案：D
126、习近平新时代中国特色社会主义思想中（  ），就是高瞻远瞩、统揽全局，善于把握事物发展总体趋势和方向。
A、创新思维
B、历史思维
C、辩证思维
D、战略思维
答案：D
127、（  ）是历史的创造者。
A、国民
B、公民
C、党员
D、人民群众
答案：D
128、习近平新时代中国特色社会主义思想中（  ），就是以史为鉴、知古鉴今，善于运用历史眼光认识发展规律、把握前进方向、指导现实工作。
A、法治思维
B、历史思维
C、底线思维
D、创新思维
答案：B
129、明确“五位一体”总体布局和“四个全面”战略布局，确定稳中求进工作总基调，统筹发展和安全。“四个全面”指（  ）？
①全面建设社会主义现代化国家②全面深化改革
③全面依法治国④全面建设法治国家⑤全面从严治党
A、①②④⑤
B、①③④⑤
C、①②③⑤
D、①②③④
答案：C
130、发展社会主义民主政治，必须（  ）、人民当家作主和依法治国的有机统一。
A、以经济建设为中心
B、坚持改革开放
C、必须加强法治建设
D、坚持党的领导
答案：D
131、面对香港局势动荡变化，我们依照（   ）有效实施对特别行政区的全面管治权，落实“爱国者治港”原则，香港局势实现由乱到治的重大转折。
A、国际法和基本法
B、反分裂法和基本法
C、宪法和基本法
D、宪法和反分裂法
答案：C
132、面对国际局势急剧变化，我们保持战略定力，发扬斗争精神，在斗争中维护国家尊严和核心利益，牢牢掌握了我国（  ）。
A、发展和社会安全
B、发展和安全主动权
C、发展和社会稳定
D、发展和领土安全
答案：B
133、我们创立了新时代中国特色社会主义思想，明确坚持和发展中国特色社会主义的基本方略，提出一系列治国理政新理念新思想新战略，实现了马克思主义中国化时代化新的（   ）。
A、提升
B、突破
C、飞跃
D、提高
答案：C
134、党的建设必须坚决实现哪些基本要求（  ）。
①坚持党的基本路线
②坚持解放思想，实事求是，与时俱进，求真务实
③坚持全心全意为人民服务
④坚持民主集中制
⑤坚持从严管党治党
A、①②③④
B、①②③⑤
C、②③④⑤
D、①②③④⑤
答案：D
135、中国共产党以马克思列宁主义、毛泽东思想、邓小平理论、“三个代表”重要思想、科学发展观、（  ）作为自己的行动指南。
A、习近平新时代中国特色社会主义思想
B、《共产党宣言》
C、《共产主义原理》
D、《社会主义史》
答案：A
136、中国共产党人的初心和使命是（  ）。
A、为中国人民谋福利，为中华民族谋发展
B、为中国人谋幸福，为中华民族谋复兴
C、为中国人民谋幸福，为中华民族谋复兴
D、为中国人民谋幸福，为中华民族谋发展
答案：C
137、全党同志要坚定“四个自信”。“四个自信”是指（  ）
①道路自信②理论自信③制度自信
④文化自信⑤体制自信⑥思想自信
A、①②③④
B、①②④⑤
C、②③④⑤
D、②③④⑥
答案：A
138、贯彻新发展理念，着力推进高质量发展，推动构建新发展格局。新发展理念指（  ）
A、科技、协调、绿色、开放、共享
B、科技、创新、绿色、开放、共享
C、创新、协调、清洁、开放、共享
D、创新、协调、绿色、开放、共享
答案：D
139、一切为了群众，一切依靠群众，（  ），把党的正确主张变为群众的自觉行动。
A、从人民中来，到人民中去
B、从群众中来，到群众中去
C、从基层中来，到基层中区
D、从实践中来，到实践中去
答案：B
140、党的政治建设的首要任务是（  ）。
①保证全党服从中央        ②坚持党中央权威
③坚持党中央集中统一领导  ④坚持个人服从党组织
A、①②③④
B、②③④
C、①③④
D、①②③
答案：D
141、在党的二十大报告中，习近平总书记强调必须坚定不移走中国特色社会主义（  ）发展道路。
A、科技
B、文化
C、政治
D、理论
答案：C
142、全党全军全国各族人民在以习近平同志为核心的党中央带领下，撸起袖子加油干、风雨无阻向前行，以（  ）推进中华民族伟大复兴。
A、中国式创造化
B、中国式现代化
C、中国式发展化
D、中国式科技化
答案：B
143、人民当家做主更为扎实，全面依法治国总体格局（  ）。
A、初步形成
B、正在形成
C、基本形成
D、完全形成
答案：C
144、要坚持党的领导、人民当家作主、依法治国（  ）。
A、辩证统一
B、有机统一
C、相互协调
D、协调统一
答案：B
145、发挥人民群众积极性、主动性、创造性，巩固和发展（  ）的政治局面。
A、积极主动、团结友爱
B、积极主动、安定团结
C、生动活泼、团结友爱
D、生动活泼、安定团结
答案：D
146、全面依法治国是国家治理的一场深刻革命，关系（  ）执政兴国，关系（  ）幸福安康，关系党和国家长治久安。
A、党     群众
B、党     人民
C、国家   群众
D、国家   人民
答案：B
147、我们要坚持走中国特色社会主义法治道路，建设中国特色社会主义法治体系、建设社会主义（  ），围绕保障和促进社会公平正义。
A、法治社会
B、法治制度
C、法治领域
D、法治国家
答案：D
148、以铸牢中华民族共同体意识为主线，加强和改进党的（  ）。
A、民族工作
B、民族团结工作
C、宗教工作
D、综治工作
答案：A
149、十九大以来，我们坚持加强党的（  ）和党中央（  ）。
A、直接领导  集中统一领导
B、直接领导  直接统一领导
C、全面领导  集中统一领导
D、全面领导  直接统一领导
答案：C
150、十九大以来，全方位开展中国特色大国外交，全面推进党的建设新的（  ）。
A、伟大事业
B、伟大成就
C、伟大成绩
D、伟大工程
答案：D
151、面对“台独”势力分裂活动和外部势力干涉台湾事务的严重挑衅，党和国家坚决开展反分裂、反干涉重大斗争，展示了我们维护国家主权和领土完整、反对“台独”的（  ）。
A、坚定决心和强大信心
B、坚定决心和强大能力
C、坚强决心和强大信心
D、坚强决心和强大能力
答案：D
152、十九大以来，我们党团结带领人民，攻克了许多长期没有解决的难题，办成了许多事关长远的大事要事，推动党和国家事业取得举世瞩目的（  ）。
A、重大成就
B、重大成绩
C、重要成就
D、重要成绩
答案：A
153、十八大以来，经历了对党和人民事业具有重大现实意义和深远历史意义的三件大事，这是中国共产党和中国人民团结奋斗赢得的（  ），是彪炳中华民族发展史册的历史性胜利，也是对世界具有深远影响的历史性胜利。
A、历史性成就
B、历史性胜利
C、阶段性胜利
D、阶段性成就
答案：B
154、改革开放和社会主义现代化建设取得巨大成就，党的建设新的伟大工程取得显著成效，为我们继续前进奠定了（  ）、创造了（  ）、提供了（  ）。
A、坚定基础、良好基础、重要保证
B、坚实基础、良好条件、重要保证
C、坚定基础、良好基础、重要保障
D、坚实基础、良好条件、重要保障
答案：D
155、新时代十年的伟大变革，在党史、新中国史、改革开放史、社会主义发展史、中华民族发展史上具有（  ）。
A、划时代意义
B、跨时代意义
C、里程碑意义
D、丰碑意义
答案：C
156、面对影响党长期执政、国家长治久安、人民幸福安康的突出矛盾和问题，党团结带领全党全军全国各族人民进行具有许多（  ）的伟大斗争。
A、新的历史特征
B、新的历史特点
C、新的历史形式
D、新的历史行为
答案：B
157、我们要坚持（  ）工作总基调。
A、又快又好
B、高效安全
C、速中求稳
D、稳中求进
答案：D
158、“党和国家提出并贯彻新发展理念，着力推进高质量发展，推动构建新发展格局，实施（  ）。
A、优化经济结构
B、节能减排
C、绿色低碳的发展方式
D、供给侧结构性改革
答案：D
159、我们创立了新时代中国特色社会主义思想，明确坚持和发展中国特色社会主义的基本方略，提出一系列治国理政新理念新思想新战略，实现了马克思主义中国化时代化（  ）。
A、新的发展
B、新的改变
C、新的变化
D、新的飞跃
答案：D
160、我国一些关键核心技术实现突破，战略性新兴产业发展壮大，许多领域等取得重大成果，进入（  ）国家行列。
A、制造型
B、创造型
C、创新型
D、科技型
答案：C
161、我国制造业规模、外汇储备稳居世界（  ）。
A、第一
B、第二
C、第三
D、第四
答案：A
162、坚持走中国特色社会主义政治发展道路，全面发展（  ），社会主义民主政治制度化、规范化、程序化全面推进。
A、直接人民民主
B、间接人民民主
C、社会主义民主
D、全过程人民民主
答案：D
163、以巨大的政治勇气全面深化改革，许多领域实现历史性变革、系统性重塑、整体性重构，中国特色社会主义制度（  ），国家治理体系和治理能力现代化水平明显提高。
A、更加成熟更加稳定
B、更加成熟更加定型
C、更加稳定更加定型
D、更加稳定更加成熟
答案：B
164、以党的（  ）统领党的建设各项工作。
A、制度建设
B、廉政建设
C、文化建设
D、政治建设
答案：D
165、、全面建设社会主义现代化国家，是一项（  ）而艰巨的事业，前途光明，任重道远。
A、伟大
B、光荣
C、荣耀
D、重大
答案：A
166、开展了史无前例的反腐败斗争，以“得罪千百人、不负十四亿”的使命担当祛疴治乱，不敢腐、（  ）一体推进。
A、不能腐、不愿腐
B、不能腐、不想腐
C、不想腐、不愿腐
D、不想腐、不可腐
答案：B
167、一切从实际出发，着眼解决新时代改革开放和社会主义（  ）建设的实际问题。
A、经济
B、科技
C、法制化
D、现代化
答案：D
168、广大青年要坚定不移（  ），怀抱梦想又脚踏实地。
A、听党话、感党恩
B、听党话、跟党走
C、感党恩、跟党走
D、学党史、感党恩
答案：B
169、（  ）是全面建设社会主义现代化国家的首要任务。
A、高质量发展
B、高速发展
C、全面发展
D、科学发展
答案：A
170、全方位夯实（  ）根基，牢牢守住十八亿亩耕地红线。
A、耕地安全
B、食品安全
C、粮食安全
D、口粮安全
答案：C
171、要坚持教育优先发展、科技自立自强、人才引领驱动，加快建设（  ）、科技强国、人才强国，坚持为党育人、为国育人。
A、文化强国
B、教育强国
C、网络强国
D、数字化强国
答案：B
171、推进（  ），建设全民终身学习的学习型社会、学习型大国。
A、教育智能化
B、教育数字化
C、线上教育
D、互联网教育
答案：B
172、深化行政执法体制改革，全面推进严格规范（  ）执法，加大关系群众切身利益的重点领域执法力度，完善行政执法程序，健全行政裁量基准。
A、公平公正
B、公正严格
C、公正文明
D、公正透明
答案：C
173、增强（  ），围绕举旗帜、聚民心、育新人、兴文化、展形象，建设社会主义文化强国。
A、文化自信
B、理论自信
C、制度自信
D、道路自信
答案：A
174、满足人民日益增长的（  ），巩固全党全国各族人民团结奋斗的共同思想基础，不断提升国家文化软实力和中华文化影响力。
A、精神需求
B、文化需求
C、物质需求
D、精神文化需求
答案：D
175、我们要实现好、维护好、发展好最广大人民根本利益，紧紧抓住人民最关心最直接最现实的利益问题，坚持尽力而为、量力而行，（  ）。
A、深入人民、深入基层
B、深入群众、深入基层
C、深入社会、深入底层
D、深入农村、深入人民
答案：B
176、优化人口（  ），建立生育支持政策体系，降低生育、养育、教育成本。
A、发展模式
B、发展形式
C、发展战略
D、发展策略
答案：C
177、实施积极应对人口老龄化国家战略，发展养老事业和养老产业，优化孤寡老人服务，推动实现全体老人享有（  ）养老服务。
A、基本
B、基础
C、优质
D、配套
答案：A
178、发展壮大医疗卫生队伍，把工作重点放在（  ）。
A、城市和街道
B、城市和农村
C、农村和街道
D、农村和社区
答案：D
179、实施（  ）战略，推进各类资源节约集约利用，加快构建废弃物循环利用体系。
A、绿色发展
B、可循环发展
C、全面节约
D、全面可持续
答案：C
180、推行草原森林河流湖泊湿地休养生息，实施好长江（  ）禁渔，健全耕地休耕轮作制度。
A、五年
B、十年
C、十五年
D、二十年
答案：B
181、发展壮大群防群治力量，营造（  ）社会氛围，建设人人有责、人人尽责、人人享有的社会治理共同体。
A、和谐友爱
B、和谐互助
C、见义勇为
D、团结互助
答案：C
182、解决台湾问题、实现祖国完全统一，是党矢志不渝的历史任务，是全体中华儿女的共同愿望，是实现中华民族伟大复兴的（  ）。
A、前提
B、要求
C、总体要求
D、必然要求
答案：D
183、促进大国协调和良性互动，推动构建和平共处、总体稳定、均衡发展的（  ）。
A、大国关系
B、国家关系
C、地区关系
D、地缘关系
答案：A
184、建设堪当民族复兴重任的高素质干部队伍，坚持德才兼备、（  ）、五湖四海、任人唯贤，树立选人用人正确导向。
A、以才为先
B、以资为先
C、以人为先
D、以德为先
答案：D
185、全面（  ）是党永葆生机活力、走好新的赶考之路的必由之路。
A、从严治党
B、从严管党
C、加强党的政治建设
D、加强党的制度建设
答案：A
186、我们推进的现代化，是（  ）领导的社会主义现代化，必须坚持以中国式现代化推进中华民族伟大复兴，既不走封闭僵化的老路，也不走改旗易帜的邪路，坚持把国家和民族发展放在自己力量的基点上、把中国发展进步的命运牢牢掌握在自己手中。
A、政府
B、中国共产党
C、全国人民
D、职工群众
答案：B
187、习近平指出，从党的十八大开始，中国特色社会主义进入（  ）。
A、新征程
B、新阶段
C、新时代
D、新局面
答案：C
188、首次进入美国市场的中国具有完全知识产权的大型智能设备是（）。
A、汽车冲压线  
B、电池  
C、地铁     
D、电机
答案：A
189、2006年以前，全世界只有哪些国家具备60千瓦以上的大功率电力设备的独立开发和制造能力（）？
A、美国和日本  
B、日本和德国  
C、日本和中国  
D、美国和德国
答案：D
190、刘霞及其团队经历了多少次试验成功摸索出独特的转子焊接技术？
A、70   
B、90   
C、60  
D、80  
答案：A
191、哪个国家是全球火力发电设备的产销量第一的制造强国（）？
A、美国   
B、德国  
C、日本  
D、中国
答案：D
192、自从中国的制造业打入空冷装备市场，一套空冷岛设备的设计费用从过去的（）降到了（）。
A、3000多；500多  
B、1000多；500多  
C、3000多；1000多  
D、2000多；500多
答案：A
193、党的十八大提出实施创新驱动发展战略，强调（）是提高社会生产力和综合国力的战略支撑，必须摆在国家发展全局的核心位置？
A、文化自信    
B、科技创新    
C、意识形态    
D、国家安全
答案：B
194、全球新一轮科技革命、产业变革和军事变革加速演进，正在重塑世界竞争格局、改变国家力量对比，（）成为许多国家谋求竞争优势的核心战略？
A、发展教育     
B、经济建设    
C、创新驱动     
D、文化输出
答案：C
195、实现创新驱动发展需要坚持（）和（）同步发力。
A、教育发展；人才培养     
B、科技体制改革；经济社会改革
C、科技体制改革；人才培养    
D、教育发展；经济社会改革
答案：B
196、根据《国家创新驱动发展战略纲要》的战略目标要求，到2020年，我国应进入创新型国家行列，科技进步贡献率提高到（）以上，知识密集型服务业增加值占国内生产总值的（）。
A、20%；40%    
B、40%；60%   
C、20%；60%    
D、60%；20%
答案：D
197、根据《国家创新驱动发展战略纲要》的战略目标要求，我国到（）跻身创新型国家前列。
A、2020     
B、2022   
C、2030   
D、2035
答案：C
198、根据《国家创新驱动发展战略纲要》的战略目标要求，我国到（）建成世界科技创新强国，成为世界主要科学中心和创新高地。
A、2050     
B、2022   
C、2030   
D、2035
答案：A
199、实现创新驱动要坚持双轮驱动，是指（）和（）两个轮子相互协调、持续发力。
A、科技创新；教育创新      
B、教育创新；体制机制创新  
C、科技创新；体制机制创新    
D、科技创新；理论创新
答案：C
200、习近平创新驱动发展战略思想的正式起点是（）。
A、党的十七大  
B、党的十八大      
C、党的十九大    
D、党的二十大
答案：B
201、习近平创新驱动发展战略思想的标志是（）。
A、提出科技是第一生产力
B、提出科技创新是提高社会生产力和综合国力的战略支撑
C、提出新发展理念
D、提出创新驱动发展战略
答案：C
202、（）是习近平创新驱动发展战略思想的理论中心。
A、科技逻辑      
B、经济逻辑     
C、政治逻辑     
D、理论逻辑
答案：A
203、（）是习近平创新驱动发展战略思想的理论基质。
A、科技逻辑      
B、理论逻辑     
C、政治逻辑     
D、创新经济逻辑
答案：D
204、创新型国家是指以（）作为经济社会发展核心驱动力的国家。
A、自主创新     
B、独立自主     
C、国泰民安     
D、和平发展
答案：A
205、中国在全球创新指数的排名由2017年的第22位上升到2021年第（）位。
A、17      
B、14      
C、15      
D、12
答案：D
206、2021年，全国超过（）万个车主选择新能源汽车。
A、87   
B、300    
C、350    
D、42
答案：C
207、中国新能源汽车电池续航充一次电，从2018年平均能跑（）公里提升到2021年平均能跑（）公里。
A、200；400    
B、200；500    
C、200；300    
D、300；400
答案：A
208、当前，全世界约有（）的新能源汽车安装的是中国制造的电池。
A、40%      
B、50%    
C、60%      
D、70%
答案：B
209、当前，中国企业拥有（）动力电池专利。
A、7万多件     
B、8万多件    
C、9万多件     
D、10万多件
答案：C
210、美国康奈尔大学珍藏的世界第一本中文科学刊物名为（）。
A、天文   
B、科技   
C、科学  
D、进步  
答案：C
211、1915年，一批中国留学生以（）为目的创办了《科学》杂志。
A、科技救国  
B、科学救国  
C、进步救国   
D、发展救国
答案：B
212、1915年，《科学》杂志的创始人是（）。
A、邓小平   
B、任鸿隽  
C、周恩来   
D、孙中山 
答案：B
213、以毛泽东为核心的党中央向全党全国发出“向科学进军”的号召的时间是（）年。
A、1953   
B、1956  
C、1970  
D、1967  
答案：B
214、1978年，党中央召开全国科学大会，邓小平同志在大会上作出（）的重要论断，我国迎来“科学的春天”。
A、科学技术是生产力   
B、经济建设为中心   
C、从严治党   
D、党的领导
答案：A
215、（）是国之利器，国家赖之以强，企业赖之以赢，人民生活赖之以好。
A、民主   
B、法制     
C、经济     
D、科技
答案：D
216、经济全球化表面上看是商品、资本、信息等在全球广泛流动，但本质上主导这种流动的力量是（）、是（）。
A、政治；教育   
B、教育；经济    
C、人才；科技创新能力  
D、教育；科技
答案：C
217、（）是科技和经济紧密结合的重要力量，应该成为技术创新决策、研发投入、科研组织、成果转化的主体。
A、企业    
B、政府   
C、高校   
D、人才
答案：A
218、（）是我国科技发展的主要基础所在，也是科技创新人才的摇篮。
A、企业和研究院  
B、政府和企业  
C、科研院所和研究型大学  
D、高校和政府
答案：C
219、2021年，在国内外科技竞争和技术冲突加剧的背景下，习近平提出实施三大战略的具体要求，要“把握大势、抢占先机，直面问题、迎难而上”，从（）整体层面完善创新体系，突出科技层面的自立自强。
A、国家  
B、经济   
C、现代化   
D、国际  
答案：A
220、（）是促进劳动者创造、掌握和运用先进科学技术的重要途径。
A、工作    
B、劳动   
C、教育过程   
D、闲暇
答案：C
221、目前的国际竞争中，守成大国对新兴大国的遏制在（）领域体现得最为明显。
A、科学技术发展   
B、政治    
C、文化   
D、意识形态  
答案：A
222、习近平关于科教兴国战略的重要论述是对党中央领导决策一脉相承的延续，在理论上创新性引入（）的理念，进一步把创新对于科技和国家经济发展的重要性提升到至高地位，提出构建国家创新体系，深入实施创新驱动发展战略。
A、教育强国    
B、科技强国   
C、人才强国  
D、创新驱动 
答案：D
223、习近平将科技、教育、人才、创新等要素统合到国家经济和社会建设的具体进程当中，进行整体性、综合性、系统性地谋篇布局，遵循（）的逻辑链，全面地提出“必须坚持科技是第一生产力、人才是第一资源、创新是第一动力”。
A、生产力—资源—动力   
B、生产力—资源—创新   
C、教育—劳动—生产力    
D、科技—资源—创新
答案：A
224、高质量发展教育事业，关键在于（）。
A、高校    
B、教师    
C、学生   
D、党的领导
答案：D
225、（）是科教兴国战略的关键。
A、教育强国    
B、人才强国    
C、制造强国    
D、科技强国
答案：D
226、习近平强调要“实现高水平科技自立自强，以（）为导向，集聚力量进行原创性引领性科技攻关，坚决打赢关键核心技术攻坚战”。
A、世界科技前沿  
B、经济主战场  
C、国家战略需求  
D、人民生命健康
答案：C
227、（）是教育发展的目的，是科技创新的根基，是国家发展的直接推动者。
A、科研    
B、创新    
C、人才   
D、发展  
答案：C
228、在人才的管理和应用上，坚持党管人才，坚持以（）为先，坚持汇聚人才。
A、智   
B、德    
C、美   
D、劳
答案：B
229、当今世界，人才资源成为经济社会发展第一资源，（）已经成为综合国力竞争的核心要素之一。
A、科技   
B、教育  
C、人才竞争   
D、经济
答案：C
230、习近平总书记深刻指出，（）是衡量一个国家综合国力的重要指标，也是实现民族振兴、赢得国际竞争主动的战略资源，硬实力、软实力，归根到底要靠人才实力。
A、科技   
B、教育  
C、人才   
D、经济
答案：C
231、党的十八大以来，党中央作出（）是实现民族振兴、赢得国际竞争主动的战略资源的重大判断，作出全方位培养、引进、使用人才的重大部署，推动新时代人才工作取得历史性成就、发生历史性变革。
A、人才   
B、经济   
C、政治    
D、文化    
答案：A
232、要深化人才发展体制机制改革。要根据需要和实际向（）充分授权，发挥其在人才培养、引进、使用中的积极作用。
A、政府     
B、高校    
C、研究所      
D、用人主体  
答案：D
233、我国拥有世界上规模最大的（），有各项事业发展的广阔舞台，完全能够源源不断培养造就大批优秀人才，完全能够培养出大师。
A、制造业体系     
B、社会保障体系    
C、高等教育体系   
D、基础教育体系
答案：C
234、党的二十大报告提出“人才是第一资源”“人才强国战略”“人才引领驱动”等关于人才的重要论述，体现了（）建设在全面建成社会主义现代化强国新征程中的重要战略地位。
A、制造强国    
B、体育强国   
C、航天强国   
D、人才强国
答案：D
235、2021年9月，中央人才工作会议要求，到（）年，形成我国在诸多领域人才竞争比较优势，国家战略科技力量和高水平人才队伍位居世界前列。
A、2035    
B、2025   
C、2020    
D、2045
答案：A
236、目前，我国已建成世界上最大规模的教育体系，高等教育进入普及化阶段，劳动年龄人口平均受教育年限达（）年。
A、11    
B、13     
C、9    
D、10.9
答案：D
237、在世界各国发展史上，（）是第一个鲜明提出系统性国家人才发展战略，并明确相关战略议程、战略任务和战略实施路线图的国家？
A、美国     
B、德国   
C、中国   
D、日本
答案：C
238、总体上我国人才强国战略的实施、发展可划分为四个阶段，即提出阶段（）、形成阶段（2003～2009年）、增强阶段（2010～2021年）和提升阶段（2021年以来）.
A、1978-2002   
B、1969-1978   
C、2002-2005   
D、1978-2005
答案：A
239、总体上我国人才强国战略的实施、发展可划分为四个阶段，即提出阶段（1978～2002年）、形成阶段（）、增强阶段（2010～2021年）和提升阶段（2021年以来）。
A、2003-2009   
B、2002-2005   
C、2005-2009  
D、2003-2003
答案：A
240、2016年中央印发（），针对阻碍人才发展的国家制度束缚和一系列关键症结问题，打响了“放权”“松绑”人才体制机制改革攻坚战。
A、《国家中长期人才发展规划纲要（2010－2020年）》
B、《关于深化人才发展体制机制改革的意见》
C、《关于进一步加强党管人才工作的意见》
D、《2020年全球创新指数排名》
答案：B
241、截至2020年，我国人才总量达到（）亿人。
A、2.18   
B、2.44    
C、3    
D、2.2
答案：D
242、根据《2020年全球创新指数排名》显示，我国排名从2015年的第29位快速上升到第（）位。
A、12    
B、13    
C、14    
D、15
答案：C
243、（）以及接下来相关战略落实体系的建立，将意味着我国人才强国战略实施和人才工作发展进入了一个历史性的新境界。
A、新时代人才引领发展战略地位的突出
B、国家人才高地和人才平台的人才中心城市建设
C、激发人才活力的高校院所人才人事管理制度建设
D、人才成长规律和科研创新规律的人才发展体制机制改革
答案：A
244、2021年，中央本级基础研究支出（）亿元、增长15.3%，2022年继续支持欠发达地区科技人才培养，中央财政“三区”（偏远贫困地区、边疆民族地区和革命老区）科技人才支持预算（）亿元，各级财政对于引才聚才的保障财力也在不断加大，科研人才素质持续提升，为我国科研领域突破创新奠定了坚实基础。
A、720.91；5     
B、720.91；3.2   
C、800；5     
D、800；3.2
答案：B
245、中国杂交水稻之父是（）。
A、袁隆平    
B、丁颖    
C、金善宝    
D、李竞雄
答案：A
246、从现在起，中国共产党的中心任务就是团结带领全国各族人民全面建成社会主义现代化强国、实现第二个百年奋斗目标，以（ ）全面推进中华民族伟大复兴。
A、中国式现代化  
B、全球式现代化  
C、民族式现代化  
D、区域式现代化
答案：A
247、在新中国成立特别是改革开放以来长期探索和实践基础上，经过（  ）以来在理论和实践上的创新突破，我们党成功推进和拓展了中国式现代化。
A、十五大   
B、十六大   
C、十七大   
D、十八大
答案：D
248、我国十四亿多人口整体迈进现代化社会，规模（ ）现有发达国家人口的总和，艰巨性和复杂性前所未有，发展途径和推进方式也必然具有自己的特点。
A、小于  
B、等于   
C、超过   
答案：C
249、我们坚持把实现人民对美好生活的向往作为现代化建设的出发点和落脚点，着力维护和促进社会公平正义，着力促进全体人民（ ），坚决防止两极分化。
A、摆脱贫困   
B、实现温饱   
C、迈向小康   
D、共同富裕
答案：D
250、全面建成社会主义现代化强国，总的战略安排是分( )。
A、两步走   
B、三步走   
C、四步走   
D、五步走
答案：A
251、从二〇二〇年到（ ）基本实现社会主义现代化。
A、二〇二五年   
B、二〇三〇年  
C、二〇三五年   
D、二〇四〇年
答案：C
252、从二〇三五年到（ ）把我国建成富强民主文明和谐美丽的社会主义现代化强国。
A、本世纪上叶   
B、本世纪中叶   
C、本世纪下叶   
答案：B
253、中共中央总书记、国家主席、中央军委主席习近平在学习贯彻党的二十大精神研讨班开班式上发表重要讲话强调，概括提出并深入阐述中国式现代化理论，是党的（ ）的一个重大理论创新，是科学社会主义的最新重大成果。
A、十七大   
B、十八大   
C、十九大   
D、二十大
答案：D
254、党的十八大以来，我们在认识上不断深化，创立了（  ），实现了马克思主义中国化时代化新的飞跃，为中国式现代化提供了根本遵循。
A、新时代中国特色社会主义思想
B、新时代中国特色社会主义经济思想
C、新时代中国特色社会主义法治思想
D、新时代中国特色社会主义生态文明思想
答案：A
255、(   )直接关系中国式现代化的根本方向、前途命运、最终成败。
A、党的领导    
B、工农联盟   
C、经济建设    
D、统一战线
答案：A
256、中国式现代化既有各国现代化的共同特征，更有基于（  ）的鲜明特色。
A、自己国情   
B、民族融合   
C、区域发展   
D、地理位置
答案：A
257、中国式现代化，深深植根于（  ），体现科学社会主义的先进本质，借鉴吸收一切人类优秀文明成果，代表人类文明进步的发展方向，展现了不同于西方现代化模式的新图景，是一种全新的人类文明形态。
A、中华优秀传统文化   
B、物质文化   
C、非物质文化    
D、大众文化
答案：A
258、中国式现代化，打破了（  ）的迷思，展现了现代化的另一幅图景，拓展了发展中国家走向现代化的路径选择，为人类对更好社会制度的探索提供了中国方案。
A、“现代化=全球化”   
B、“现代化=国际化”  
C、“现代化=西方化”   
D、“现代化=去民族化”
答案：C
259、中国式现代化为广大（  ）独立自主迈向现代化树立了典范，为其提供了全新选择。
A、发达国家   
B、发展中国家  
C、发达地区   
D、欠发达地区
答案：B
260、要把（ ）摆在国家发展全局的突出位置，顺应时代发展要求，着眼于解决重大理论和实践问题，积极识变应变求变，大力推进改革创新，不断塑造发展新动能新优势，充分激发全社会创造活力。
A、教育   
B、文化   
C、创新   
D、开放
答案：C
261、党的十八大以来，中国经济实力跃上新台阶。经济总量由2012年的53.9万亿元上升到2021年的114.4万亿元，占世界经济比重从11.3%上升到超过（ ）。
A、15%   
B、16%    
C、17%    
D、18%
答案：D
262、我国全球创新指数排名从十年前的第三十四位提升到现在（2021年）的（ ）。
A、第十一位   
B、第十二位    
C、第十三位   
D、第十四位
答案：B
263、十年来，始终把基础研究和前沿技术开发摆在突出位置，布局建设了上海光源等40多个重大科技基础设施，全力打造北京、上海、粤港澳大湾区国际科技创新中心和怀柔、张江、合肥、（ ）综合性国家科学中心。
A、西安    
B、武汉    
C、杭州    
D、大湾区
答案：D
264、十年来，我国基础研究经费提高3倍，国内发明专利、PCT国际申请量跃居（ ）。
A、全球第一    
B、全球第二    
C、全球第三    
D、全球第四
答案：A
265、我国数字经济规模已位居（ ）。
A、全球第一    
B、全球第二    
C、全球第三    
D、全球第四
答案：B
266、京津冀地区紧紧抓住北京（ ）这个“牛鼻子”推动区域协同发展，雄安新区高标准高质量推进建设。
A、非首都功能疏解    
B、文化功能疏解    
C、金融功能疏解      
D、医疗功能疏解
答案：A
267、粤港澳大湾区深化合作迈出新步伐，2021年粤港澳大湾区内地九市地区生产总值超过（ ）。
A、8万亿元    
B、9万亿元   
   C、10万亿元   
D、11万亿元
答案：C
268、长江经济带生态环境保护修复稳步推进，长江（ ）全面实施，我国第一部流域法“长江保护法”颁布实施。
A、“五年禁渔”    
B、“十年禁渔”    
C、“十五年禁渔”  
D、“二十年禁渔”
答案：B
269、黄河流域防洪体系不断完善，实现了黄河干流连续（ ）不断流。
A、5年    
B、10年    
C、15年    
D、20多年
答案：D
270、过去十年，我国民营企业数量是原来的（ ）。
A、一倍    
B、两倍    
C、三倍    
D、四倍
答案：D
271、过去十年，形成了100多万亿元经济总量、14亿人口、（ ）中等收入群体的强大内需市场。
A、2亿左右    
B、3亿左右    
C、4亿左右    
D、5亿左右
答案：C
272、2021年我国实际使用外资达到1.15万亿元人民币，位居（ ），引资规模稳居发展中国家首位。
A、世界第一    
B、世界第二    
C、世界第三    
D、世界第四
答案：B
273、新民主主义革命时期的浴血奋战和伟大胜利，为实现现代化（ ）。
A、创造了根本社会条件
B、奠定根本政治前提和宝贵经验、理论准备、物质基础
C、提供了充满新的活力的体制保证和快速发展的物质条件
D、推进和拓展了中国式现代化
答案：A
274、新中国成立后的社会主义革命和建设，为现代化建设（ ）。
A、创造了根本社会条件
B、奠定根本政治前提和宝贵经验、理论准备、物质基础   
C、提供了充满新的活力的体制保证和快速发展的物质条件
D、推进和拓展了中国式现代化
答案：B
275、改革开放和社会主义建设新时期，实现了人民生活从温饱不足到总体小康、奔向全面小康的历史性跨越，为中国式现代化（ ）。
A、创造了根本社会条件
B、奠定根本政治前提和宝贵经验、理论准备、物质基础   
C、提供了充满新的活力的体制保证和快速发展的物质条件
D、推进和拓展了中国式现代化
答案：C
276、党的十八大以来，中国特色社会主义进入新时代。在以习近平同志为核心的党中央坚强领导下，我们党在已有基础上继续前进，不断实现理论和实践上的创新突破，成功（ ）。
A、创造了根本社会条件
B、奠定根本政治前提和宝贵经验、理论准备、物质基础   
C、提供了充满新的活力的体制保证和快速发展的物质条件
D、推进和拓展了中国式现代化
答案：D
277、历史和实践充分证明，坚持（ ），是中国式现代化最鲜明的特征和最突出的优势，是推进中国式现代化必须坚持的首要原则。
A、中国共产党领导    
B、经济建设为中心   
C、工农联盟      
D、统一战线
答案：A
278、历史和实践充分证明，（  ）不仅走得通、行得稳，而且越走越宽广。
A、民族式现代化道路    
B、全球式现代化道路   
C、区域式现代化道路    
D、中国式现代化道路
答案：D
279、（ ）为中国式现代化提供了强有力的制度支撑，这是中国式现代化取得成功的决定性因素。
A、经济制度优势
B、文化制度优势
C、教育制度优势
D、社会主义制度优势
答案：D
280、党的二十大报告指出，要加快实施创新驱动发展战略。坚持面向世界科技前沿、面向经济主战场、面向国家重大需求、面向人民生命健康，加快实现高水平科技（ ）。
A、自立自强
B、自给自足
C、自产自销
D、走向世界
答案：A
281、党的二十大报告指出，我们加快推进科技自立自强，全社会研发经费支出从一万亿元增加到二万八千亿元，居世界第（   ）位。
A、1
B、2
C、3
D、4
答案：B
282、党的二十大报告指出，我们加快推进科技自立自强，研发人员总量居世界（     ）。
A、首位
B、第二位
C、第三位
D、第四位
答案：A
283、党的二十大报告指出，我国基础研究和原始创新不断加强，一些关键核心技术实现突破，战略性新兴产业发展壮大，载人航天、探月探火、深海深地探测、超级计算机、卫星导航、量子信息、核电技术、新能源技术、大飞机制造、生物医药等取得重大成果，进入（   ）国家行列。
A、发达
B、发展中
C、创新型
D、科技型
答案：C
284、2022年，中国研发经费投入首次突破（  ）大关，比上年增长10.4%，自“十三五”以来已连续7年保持两位数增长。
A、5万亿元
B、4万亿元
C、3万亿元
D、2万亿元
答案：C
285、2022年，中国研发经费投入强度达到（   ）。
A、2.55%
B、2.44%
C、2.66%
D、2.77%
答案：A
286、世界知识产权组织发布的《2022年全球创新指数报告》显示，中国的全球创新指数排名第（    ），连续十年稳步提升，位居36个中高收入经济体之首。
A、8
B、9
C、10
D、11
答案：D
287、习近平总书记指出，“面对新形势新挑战，我们必须加快从要素驱动为主向（   ）发展转变，发挥科技创新的支撑引领作用，推动实现有质量、有效益、可持续的发展。这是着眼全局、面向未来作出的重大战略调整，对我国未来发展具有十分重要的意义。”
A、投资驱动
B、财富驱动
C、科技驱动
D、创新驱动
答案：D
288、党的二十大报告指出，加强（   ），突出原创，鼓励自由探索。
A、应用研究
B、基础研究
C、科技研究
D、数字研究
答案：B
289、党的二十大报告指出，加强基础研究，突出（   ），鼓励自由探索。
A、原创
B、应用
C、科技
D、市场
答案：A
290、党的二十大报告指出，加强（  ）主导的产学研深度融合，强化目标导向，提高科技成果转化和产业化水平。
A、政府
B、高校
C、企业
D、市场
答案：C
291、习近平总书记强调，实施创新驱动发展战略，最根本的是要增强（   ），最紧迫的是要破除体制机制障碍，最大限度解放和激发科技作为第一生产力所蕴藏的巨大潜能。
A、政府主导能力
B、研发经费投入
C、自主创新能力
D、市场转化能力
答案：C
292、习近平总书记强调，在激烈的国际竞争面前，在单边主义、保护主义上升的大背景下，我们必须走出适合国情的创新路子，特别是要把（    ）提升摆在更加突出的位置，努力实现更多“从0到1”的突破。
A、原始创新能力
B、政府引导能力
C、自主创新能力
D、市场转化能力
答案：A

 二、多选题（95题）
1、党的二十大的主题是、高举中国特色社会主义伟大旗帜，全面贯彻新时代中国特色社会主义思想，弘扬伟大建党精神，（   ），为全面建设社会主义现代化国家、全面推进中华民族伟大复兴而团结奋斗。
A、自信自强
B、守正创新
C、踔厉奋发
D、勇毅前行
答案：ABCD
2、我们党立志于（   ）。
A、中华民族千秋伟业
B、人类和平与发展
C、责任无比重大
D、使命无尚光荣
答案：ABCD
3、我们隆重庆祝中国共产党成立(   )、中华人民共和国成立(   )，制定第(   )个历史决议，在全党开展党史学习教育，号召全党(   )伟大建党精神。 
A、一百周年
B、七十周年
C、三
D、学习、践行
答案：ABCD
4、十八大召开以来，我们经历了对党和人民事业具有重大现实意义和深远历史意义的三件大事、一是(   )，二是(   )，三是(   )。 
A、迎来中国共产党成立一百周年
B、中国特色社会主义进入新时代
C、完成脱贫攻坚、全面建成小康社会的历史任务，实现第一个百年奋斗目标
D、已经实现中华民族伟大复兴
答案：ABC
5、实现建军一百年奋斗目标，开拓国防和军队现代化新局面，要（    ）。
A、全面加强人民军队党的建设
B、全面加强练兵备战
C、全面加强军事治理
D、巩固提高一体化国家战略体系和能力
答案：ABCD
6、对新时代党和国家事业发展作出科学完整的战略部署，提出实现中华民族伟大复兴的中国梦，统揽（    ）。
A、伟大斗争
B、伟大工程
C、伟大事业
D、伟大梦想
答案：ABCD
7、党和国家深入贯彻以人民为中心的发展思想，在幼有所育、学有所教、劳有所得、病有所医、老有所养、住有所居、弱有所扶上持续用力，建成世界上规模最大的（  ）、（  ）、（  ），人民群众获得感、幸福感、安全感更加充实、更有保障、更可持续，共同富裕取得新成效。
A、教育体系
B、社会保障体系
C、医疗体系
D、法律体系
答案：ABC
8、确立党在新时代的强军目标，贯彻新时代党的（  ），贯彻新时代（  ），坚持党对人民军队的（  ），统筹加强各方向各领域（  ），大刀阔斧深化国防和军队改革，人民军队体制一新、结构一新、格局一新、面貌一新。
A、强国思想
B、强军思想
C、军事战略方针
D、绝对领导
E、军事斗争
答案：BCDE
9、我们全面推进中国特色大国外交，推动构建人类命运共同体，坚定维护国际公平正义，倡导践行真正的多边主义，旗帜鲜明反对一切霸权主义和强权政治，毫不动摇反对任何（   ）。
A、单边主义
B、贸易保护主义
C、保护主义
D、霸凌行径
答案：ACD
10、党和国家以钉钉子精神纠治“四风”，反对特权思想和特权现象，刹住了一些长期没有刹住的歪风，纠治了一些多年未除的顽瘴痼疾。“四风”指（    ）
A、形式主义
B、官僚主义
C、享乐主义
D、奢靡之风
E、攀比之风
答案：ABCD
11、经过不懈努力，党找到了自我革命这一跳出治乱兴衰历史周期率的第二个答案，确保党永远（    ）。
A、不变质
B、不变心
C、不变色
D、不变味
答案：ACD
12、十八大以来，我们党勇于进行理论探索和创新，以全新的视野深化对(      )的认识，取得重大理论创新成果，集中体现为新时代中国特色社会主义思想。 
A、共产党执政规律
B、社会主义建设规律
C、脱贫工作
D、人类社会发展规律
E、环境治理
答案：ABD
13、坚持对马克思主义的坚定（    ）、对中国特色社会主义的坚定（    ），坚定道路自信、理论自信、制度自信、文化自信，不断提出真正解决问题的新理念新思路新办法。
A、信仰
B、信心
C、信念
D、信任
答案：AC
14、全面建成社会主义现代化强国，总的战略安排是分两步走、从＿＿＿＿基本实现社会主义现代化；从＿＿＿叶把我国建成富强民主文明和谐美丽的社会主义现代化强国。（     ）
A、二〇二〇年到二〇三五年
B、二〇二五年到二〇四〇年
C、二〇三五年到本世纪中叶
D、二〇四〇年到本世纪中叶
答案：AC
15、加快构建新发展格局，着力推动高品质发展，要（          ）
A、构建高水平社会主义市场经济体制
B、建设现代化产业体系
C、全面推进乡村振兴
D、促进区域协调发展
E、推进高水平对外开放
答案：ABCDE
16、前进道路上，必须牢牢把握以下重大原则、（    ）
A、坚持和加强党的全面领导
B、坚持中国特色社会主义道路
C、坚持以人民为中心的发展思想
D、坚持深化改革开放
E、坚持发扬斗争精神
答案：ABCDE
17、全党必须牢记，（      ）
A、坚持党的全面领导是坚持和发展中国特色社会主义的必由之路
B、中国特色社会主义是实现中华民族伟大复兴的必由之路
C、团结奋斗是中国人民创造历史伟业的必由之路
D、贯彻新发展理念是新时代我国发展壮大的必由之路
E、全面从严治党是党永葆生机活力、走好新的赶考之路的必由之路
答案：ABCDE
18、中国式现代化，是中国共产党领导的社会主义现代化，既有各国现代化的共同特征，更有基于自己国情的中国特色。中国式现代化（       ）
A、是人口规模巨大的现代化
B、是全体人民共同富裕的现代化
C、是物质文明和精神文明相协调的现代化
D、是人与自然和谐共生的现代化
E、是走和平发展道路的现代化
答案：ABCDE
19、不断谱写马克思主义中国化时代化新篇章，是当代中国共产党人的庄严历史责任，（         ）
A、必须坚持人民至上
B、必须坚持自信自立
C、必须坚持守正创新
D、必须坚持问题导向
E、必须坚持系统观念
F、必须坚持胸怀天下
答案：ABCDEF
20、坚定不移全面从严治党，深入推进新时代党的建设新的伟大工程，要（     ）
A、坚持和加强党中央集中统一领导
B、坚持不懈用新时代中国特色社会主义思想凝心铸魂
C、完善党的自我革命制度规范体系
D、建设堪当民族复兴重任的高素质干部队伍
E、增强党组织政治功能和组织功能
F、坚持以严的基调强化正风肃纪
G、坚决打赢反腐败斗争攻坚战持久战
答案：ABCDEFG
21、发展全过程民主，保障人民当家做主，要（    ）
A、加强人民当家作主制度保障
B、落实好民族区域自治
C、全面发展协商民主
D、积极发展基层民主
E、巩固和发展最广泛的爱国统一战线
答案：ACDE
22、坚持全面依法治国，推进法治中国建设，要（    ）
A、完善以宪法为核心的中国特色社会主义法律体系
B、扎实推进依法行政
C、严格公正司法
D、坚持违法必究、执法必严
E、加快建设法治社会
答案：ABCE
23、实施科教兴国战略，强化现代化建设人才支撑，要（     ）、
A、办好人民满意的教育
B、完善科技创新体系
C、加快实施创新驱动发展战略
D、深入实施人才强国战略
答案：ABCD
24、增进民生福祉，提高人民生活品质，要（     ）
A、完善分配制度
B、增加就业率
C、实施就业优先战略
D、健全社会保障体系
E、推进健康中国建设
答案：ACDE
25、推进国家安全体系和能力现代化，坚决维护国家安全和社会安全，要（     ）
A、健全国家安全体系
B、增强维护国家安全能力
C、提高公共安全治理能力
D、完善社会治理体系
答案：ABCD
26、当前，我国实施创新驱动发展已具备哪些基础？
A、科技发展进入跃升期     
B、科研体系日益完备
C、人才队伍不断壮大    
D、自主创新能力快速提升
答案：ABCD
27、实现创新驱动是一个系统性的变革，要按照“（）、（）、（）”进行布局，构建新的发展动力系统？
A、双轮驱动    
B、一个中心    
C、一个体系   
D、六大转变
答案：ACD
28、根据《国家创新驱动发展战略纲要》的战略任务要求，加快工业化和信息化深度融合，把（）、（）、（）、（）作为提升产业竞争力的技术基点？
A、网络化    
B、智能化    
C、绿色化    
D、数字化
答案：ABCD
29、实施创新驱动发展战略，必须从（）、（）、（）、（）等方面加大保障力度。
A、体制改革   
B、环境营造   
C、资源投入   
D、扩大开放
答案：ABCD
30、根据建设世界科技强国的目标愿景,习近平总书记统筹谋划,提出包括五点要求的战略布局，分别是（）、（）、（）、（）、（）？
A、夯实科技基础   
B、强化战略导向   
C、加强科技供给
D、坚持独立自主   
E、弘扬创新精神   
F、深化改革创新
答案：ABCEF
31、习近平创新驱动发展战略思想的思想特征有哪些？
A、时代性    
B、全面战略思维   
C、制度优势自信   
D、独立自主
答案：ABC
32、习近平创新驱动发展战略思想继承和发展了党的（）和（）？
A、革命思想   
B、科技思想   
C、自主创新思想   
D、社会主义市场经济思想
答案：BC
33、（）、（）、（）是新能源汽车的三大核心系统，也是中国新能源产业布局研发的重点？
A、电池    
B、电控     
C、电机     
D、电表
答案：ABC
34、（）是实现创新发展的两翼？
A、科技创新    
B、科学普及   
C、高等教育    
D、终身学习 
答案：AB
35、必须坚持（）是第一生产力、（）是第一资源、（）是第一动力，深入实施科教兴国战略、人才强国战略、创新驱动发展战略？
A、科技    
B、经济     
C、人才    
D、劳动    
E、创新
答案：ACE
36、习近平进一步丰富了科教兴国战略的内容，将创新驱动发展与科教兴国、人才强国等内容结合在一起统筹规划，形成了“（）—（）—科技—兴国强国”理论逻辑链
A、教育  
B、人才  
C、经济  
D、发展  
E、文化
答案：AB
37、习近平关于科教兴国重要论述在坚持“科学是生产力”的理论之上，进一步强调了（）和（）两个重要要素在科技、教育和生产力三者互动过程中的地位和作用，丰富了马克思主义科技观和教育观的理论内容。
A、人才   
B、教育   
C、科技   
D、创新   
E、劳动  
答案：AD
38、习近平多次强调科教兴国战略并进行具体规划，则是对（）和（）的切实关注和解答，指明了根本性的解决策略和方案？
A、人类命运共同体    
B、和平与发展  
C、时代需求    
D、现实挑战
答案：CD
39、习近平关于科教兴国战略重要论述为我国（）、（）过程中的难关、提升我国在全球经济发展和科技创新领域的比较竞争优势、建设（）和（）等问题上都提供了科学的理论指导？
A、国外技术封锁   
B、攻克产业转型   
C、世界科技强国    
D、创新型国家
答案：ABCD
40、（）是促进经济增长的重要动力，而（）是提升人力资本的最主要途径。
A、人力资本   
B、科技   
C、教育   
D、生态
答案：AC
41、教育以（）作为主要职能，是提高科教兴国战略的基础性事业。
A、提高国民整体文化素质  
B、培养尖端领域高素质人才  
C、促进科技创新  
D、提升社会文明
答案：ABCD
42、对于科技发展的方向，习近平指出要“面向（）、面向（）、面向（）、面向（）”。
A、世界科技前沿  
B、经济主战场  
C、国家重大需求  
D、人民生命健康
答案：ABCD
43、人力资本理论指出，凝聚在劳动者身上的（）、（）和（）是经济增长的主要因素，人在生产过程中的综合表现成为经济发展的内生变量。
A、知识     
B、技能     
C、能力    
D、兴趣  
答案：ABC
44、在经济新常态下，（）和（）成为经济增长的主要依靠力量，创新成为驱动发展的新引擎。
A、科技进步   
B、政治稳定    
C、人力资本    
D、社会和谐
答案：AC
45、习近平总书记在党的二十大报告中指出，“全面提高人才自主培养质量，着力造就拔尖创新人才，聚天下英才而用之”。这就是新时代实施（）战略、强化现代化建设（）的重要举措，是加快建设（）的战略部署。
A、科教兴国     
B、人才支撑      
C、体育强国      
D、人才强国
答案：ABD
46、根据党的二十大报告确定的总体要求，全面提高人才自主培养质量，就是在国内国际形势复杂多变的环境下，更加重视自主培养（）（）人才，着力造就拔尖（）人才，使人才担当民族复兴大任。
A、多层次     
B、多样化     
C、创新    
D、高学历
答案：ABC
47、集中国家优质资源重点支持建设一批国家（）和（），发起国际大科学计划，为人才提供国际一流的创新平台，加快形成战略支点和雁阵格局。
A、实验室     
B、新型研发机构     
C、企业     
D、社会组织  
答案：AB
48、要坚持长远眼光，有意识地发现和培养更多具有战略科学家潜质的（）、（）人才，形成战略科学家成长梯队。
A、高层次     
B、复合型     
C、高学历    
D、多样化 
答案：AB
49、要培养大批卓越工程师，努力建设一支（）的工程师队伍。
A、爱党报国     
B、敬业奉献     
C、具有突出技术创新能力     
D、善于解决复杂工程问题
答案：ABCD
50、广大人才要继承和发扬老一辈科学家（）、（）的优秀品质，心怀“国之大者”，为国分忧、为国解难、为国尽责。
A、胸怀祖国    
B、服务人民  
C、勤奋刻苦   
D、珍惜时间
答案：AB
51、2021年9月，中央人才工作会议召开，新时代人才强国战略总体构想提出，加快（）和（）。
A、世界重要人才中心   
B、创新高地    
C、经济强国   
D、制造强国
答案：AB
52、纵观改革开放四十多年来，我国人才强国战略由（）战略到（）战略，再到（）战略的转变历程和人才战略思想不断丰富发展的历程。
A、“追赶型”     
B、“攀登型”    
C、“夺标型”    
D、“超越型”
答案：ABC
53、新时代人才强国战略具有鲜明的（）。
A、时代性   
B、发展性    
C、问题导向性    
D、实践性
答案：ABCD
54、实施新时代人才强国战略的核心问题（）。
A、推动作为国家人才高地和人才平台的人才中心城市建设取得新突破
B、推动代表国家人才竞争力的战略人才力量建设取得新突破
C、推动激发人才活力的高校院所人才人事管理制度建设取得新突破
D、推动顺应人才成长规律和科研创新规律的人才发展体制机制改革取得新突破
答案：ABCD
55、以实施新时代人才强国战略为主线推动新阶段人才工作高质量发展的路径有哪些？（）
A、推动理论创新，构建中国特色新时代人才战略的理论构架
B、深化制度改革，构建集聚“天下英才”的体制机制
C、实现点上突破，打造国家人才高地和人才平台
D、加强监测评估，建立新时代人才强国战略实施效果的评估体系
答案：ABCD
56、企业家精神是（）。
A、创新精神    
B、伟大精神    
C、承担风险的精神     
D、探索未来的精神
答案：ACD
57、（ ）是社会主义现代化的根本要求。
A、物质富足   
B、物质建设   
C、精神富有   
D、精神建设
答案：AC
58、我们坚持可持续发展，坚持节约优先、保护优先、自然恢复为主的方针，像保护眼睛一样保护自然和生态环境，坚定不移走（ ）的文明发展道路，实现中华民族永续发展。
A、生产发展   
B、生活富裕   
C、生态良好   
D、环境优先
答案：ABC
59、中国式现代化是（ ）。
A、人口规模巨大的现代化   
B、全体人民共同富裕的现代化   
C、物质文明和精神文明相协调的现代化   
D、人与自然和谐共生的现代化
E、走和平发展道路的现代化
答案：ABCDE
60、中国式现代化的本质要求是（ ）。
A、坚持中国共产党领导   
B、坚持中国特色社会主义 
C、实现高质量发展发   
D、发展全过程人民民主 
E、丰富人民精神世界   
F、实现全体人民共同富裕 
G、促进人与自然和谐共生   
H、推动构建人类命运共同体 
I、创造人类文明新形态   
答案：ABCDEFGHI
61、全面建设社会主义现代化国家，是一项伟大而艰巨的事业，前途光明，任重道远。前进道路上，必须牢牢把握的重大原则包括（ ）。
A、坚持和加强党的全面领导   
B、坚持中国特色社会主义道路  
C、坚持以人民为中心的发展思想   
D、坚持深化改革开放
E、坚持发扬斗争精神
答案：ABCDE
62、党的十八大以来，我们进一步深化对中国式现代化的内涵和本质的认识，概括形成中国式现代化的（  ），初步构建中国式现代化的理论体系，使中国式现代化更加清晰、更加科学、更加可感可行。
A、中国特色
B、民族特色
C、本质要求
D、重大原则
答案：ACD
63、党的十八大以来，我们在战略上不断完善，深入实施（  ）等一系列重大战略，为中国式现代化提供坚实战略支撑。
A、科教兴国战略
B、人才强国战略  
C、乡村振兴战略
D、扫盲运动
答案：ABC
64、新中国成立特别是改革开放以来，我们用几十年时间走完西方发达国家几百年走过的工业化历程，创造了（ ）和（ ）的奇迹，为中华民族伟大复兴开辟了广阔前景。
A、经济平稳发展    
B、经济快速发展   
C、社会有序运行    
D、社会长期稳定
答案：BD
65、中国式现代化蕴含的独特（  ）等及其伟大实践，是对世界现代化理论和实践的重大创新。
A、世界观   
B、价值观   
C、历史观
D、文明观   
E、民主观   
F、生态观
答案：ABCDEF
66、推进中国式现代化是一个系统工程，需要统筹兼顾、系统谋划、整体推进，正确处理好（  ）等一系列重大关系。
A、顶层设计与实践探索   
B、战略与策略   
C、守正与创新     
D、效率与公平   
E、活力与秩序    
F、自立自强与对外开放
答案：ABCDEF
67、进行顶层设计，需要深刻洞察世界发展大势，准确把握人民群众的共同愿望，深入探索经济社会发展规律，使制定的规划和政策体系体现时代性、把握规律性、富于创造性，做到（ ）。
A、远近结合   
B、上下贯通   
C、内容协调   
D、古为今用
答案：ABC
68、既要创造比资本主义更高的效率，又要更有效地维护社会公平，更好实现效率与公平（ ）。
A、相兼顾   
B、相分离   
C、相促进   
D、相统一
答案：ACD
69、推进中国式现代化，是一项前无古人的开创性事业，必然会遇到各种可以预料和难以预料的风险挑战、艰难险阻甚至惊涛骇浪，必须（  ）。
A、增强忧患意识   
B、坚持底线思维   
C、居安思危、未雨绸缪
D、敢于斗争、善于斗争，通过顽强斗争打开事业发展新天地
答案：ABCD
70、推进中国式现代化必须抓好开局之年的工作。要全面贯彻落实党中央决策部署，坚持稳字当头、稳中求进，更好（  ），更好（ ），更好（ ），全面深化改革开放，推动高质量发展，进一步引导经营主体强信心、稳定社会预期，努力实现经济运行整体好转。
A、统筹国内国际两个大局   
B、统筹疫情防控和经济社会发展   
C、统筹发展和安全 
D、统筹东部和西部
答案：ABC
71、（ ）等大国重器成为国家新名片。
A、中国高铁    
B、第三代核电    
C、载人航天    
D、北斗导航
答案：ABCD
72、我国（ ）等新技术开发应用走在全球前列。
A、人工智能    
B、区块链    
C、量子通信    
D、智能驾驶
答案：ABCD
73、创新和高技术发展领域取得了哪几个方面的巨大成就？（ ）
A、高技术产业体量更大    
B、高技术产品质量更优    
C、高技术产业基础更牢    
D、创新创业创造活力更强
答案：ABCD
74、党的十八大以来，（ ）等区域重大战略，引领我国区域发展发生历史性变化、取得历史性成就。
A、京津冀协同发展    
B、长江经济带发展    
C、粤港澳大湾区建设    
D、长三角一体化发展  
E、黄河流域生态保护和高质量发展
答案：ABCDE
75、新时代十年的一系列变革性实践、突破性进展、标志性成果，推动党和国家事业取得历史性成就、发生历史性变革，为中国式现代化提供了(  )。
A、更为完善的制度保证 
B、更为坚实的物质基础
C、更为主动的精神力量
D、理论准备
答案：ABC
76、中国式现代化摒弃了西方（  ），开创了通过合作共赢实现共同发展、和平发展的现代化发展模式，破解了人类社会发展的诸多难题。
A、以资本为中心的现代化   
B、两极分化的现代化   
C、物质主义膨胀的现代化   
D、对外扩张掠夺的现代化老路
答案：ABCD
77、中国式现代化既切合中国实际，体现了（ ），也体现了（ ），为（ ）作出了重要贡献。
A、社会主义建设规律  
B、人类社会发展规律   
C、世界社会主义发展
D、世界民族主义发展
答案：ABC
78、中国式现代化的历史性贡献是（ ）。
A、中国式现代化创造了人类文明新形态   
B、中国式现代化推进中华民族伟大复兴
C、中国式现代化引领世界社会主义发展
D、中国式现代化为发展中国家走向现代化提供新选择
答案：ABCD
79、新形势下实施人才强国战略，营造的（）社会氛围。
A、尊重劳动
B、尊重知识
C、尊重人才
D、尊重创造
答案：ABCD
80、党管人才是指(   )。
A、管组织
B、管政策
C、管协调
D、管服务
E、管宏观
答案：ABCDE
81、推进人才强国战略，应采取以下措施(  )。
A、建设高素质人才队伍
B、创新人才工作机制
C、多向国外派遣爱国的留学生
D、扩大高等教育学生比例
E、废除职称体制
答案：ABCD
82、	党的十八大以来，党中央深刻地口答了（ ）的重大理论和实践问题	
A、怎么样建设人才强国
B、如何做好人才内培
C、如何对标国际建设人才强国
D、什么是人才强国
E、为什么建设人才强国
答案：ADE
83、人才管理体制改革包括(  )。
A、加强人才管理法制建设
B、大胆放权，严格用权
C、保障和落实用人主体自主权
D、社会化的人才管理服务体系
E、转变政府人才管理职能
答案：ACDE
84、我国人才发展优势包括（  ）。
A、科技应用和消费市场有利于科技产品不断升级更新
B、大国人才体量具有相对宽广的人才选拔优势
C、举国体制集中优质资源，有利突破发展瓶颈
D、全国整体布局统一调整有效避免了局部冲突和资源浪费
E、目光长远和坚强无私的领导体制
答案：ABCDE
85、建设世界人才强国的国家战略的具体措施包括（ ）。
A、确定人才优先发展的战略布局
B、确立我国人才竞争的比较优势
C、坚持以用为本，创新体制机制
D、坚持人才统筹发展的政策创新和工程创新
答案：ABCD
86、我国的科教兴国和人才强国战略是指(  )。
A、把经济建设转移到依靠科技进步上来
B、把经济建设转移到提高劳动者素质上来
C、把人才作为推进事业发展的关键因素
D、把我国由人口大国转化为人力资源强国
答案：ABCD
87、新时代要赋予科学家(  )，同时要建立健全责任制和军令状制度，确保科研项目取得成效。
A.更大技术路线决定权
B.更大经费支配权
C.更大资源调度权
D.更大社会保障权
答案：ABC
88、新时代要坚持党管人才，坚持(  )，深入实施新时代人才强国战略。
A.面向世界科技前沿 
B.面向经济主战场 
C.面向国家重大需求 
D.面向人民生命健康
答案ABCD
89、在百年奋斗历程中，我们党始终重视(  )，团结和支持各方面人才为党和人民事业建功立业。 
A.培养人才 
B.团结人才 
C.引领人才 
D.成就人才
答案:ABCD
90、加快建设世界重要人才中心和创新高地，必须把握战略主动，做好顶层设计和战略谋划。我们党的目标是(  )。
A.到2025年，全社会研发经费投入大幅增长，科技创新主力军队伍建设取得重要进展，顶尖科学家集聚水平明显提高，人才自主培养能力不断增强，在关键核心技术领域拥有一大批战略科技人才、一流科技领军人才和创新团队
B.到2030年，适应高质量发展的人才制度体系基本形成，创新人才自主培养能力显著提升，对世界优秀人才的吸引力明显增强，在主要科技领域有一批领跑者，在新兴前沿交叉领域有一批开拓者
C.到2035年，形成我国在诸多领域人才竞争比较优势，国家战略科技力量和高水平人才队伍位居世界前列
D.到2040年，在北京、上海、粤港澳大湾区建设高水平人才高地，一些高层次人才集中的中心城市建设完成吸引和集聚人才的平台，集中国家优质资源重点支持建设一批国家实验率和新型研发机松
答案:ABC
91、东莞正实施新一轮“十百千万百万”人才工程，主要包括（ ）。
A、未来三年内面向全球招揽引进10个战略科学家团队
B、引育400名博士专业人才
C、1000名领军人才
D、6万名硕士以上创新人才
E、50万名本科学历人才
答案：ABCDE
92、东莞把人才工作放在全局工作中谋划推进的原则（ ）。
A、东莞以诚引才
B、东莞以业聚才
C、东莞以心留才
D、东莞以钱揽才
答案：ABC
93、党的二十大报告指出，坚持（    ），加快实现高水平科技自立自强。
A、面向世界科技前沿
B、面向经济主战场
C、面向国家重大需求
D、面向人民生命健康
答案：ABCD

94、党的二十大报告指出，加快实施一批具有（    ）的国家重大科技项目，增强自主创新能力。
A、战略性
B、全局性
C、前瞻性
D、基础性
答案：ABC
95、党的二十大报告指出，强化企业科技创新主体地位，发挥科技型骨干企业引领支撑作用，营造有利于科技型中小微企业成长的良好环境，推动（   ）深度融合。
A、创新链
B、产业链
C、资金链
D、人才链
答案：ABCD
`;

list = text.split(/\d+、/g);
a = list.map(i=>{
    var items = i.split(/答案：/g);
    return {
        topic: items[0],
        answer: items[1]
    }
});
const fileSave = require('file-save')
 
fileSave('./main.js')
    .write(`var a = 1;`, 'utf8')
    .write(JSON.stringify(a), () => {
        console.log('写入回调');
    })
    .end('\n')
    .finish(() => {
        console.log('写入完成');
    });
console.log(a);